app/controllers/users_controller.rb

	def create
  		@user = User.new(params[:user])
  		if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "fname", "lname", "password", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)